Ran Plan for dir: `terraform/teams/team-ops/dev` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terraform show -json plan.tfplan | conftest test --all-namespaces -p ../../../policy/ -' in '/home/atlantis/.atlantis/repos/mailamiton/gcp-infra-using-terraform/8/default/terraform/teams/team-ops/dev': exit status 1: running "terraform show -json plan.tfplan | conftest test --all-namespaces -p ../../../policy/ -" in "/home/atlantis/.atlantis/repos/mailamiton/gcp-infra-using-terraform/8/default/terraform/teams/team-ops/dev": 
╷
│ Error: Couldn't show local plan
│ 
│ Plan read error: plan file was created by Terraform 1.8.4, but this is
│ 1.11.3; plan files cannot be transferred between different Terraform
│ versions
╵
Error: running test: load: loading policies: load: 1 error occurred during loading: stat ../../../policy/: no such file or directory

module.external-data-landing-zone.random_string.suffix: Refreshing state... [id=lf6z]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.external-data-landing-zone.google_project.project will be created
+ resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "019E58-6F6589-65814F"
      + deletion_policy     = "DELETE"
      + effective_labels    = (known after apply)
      + folder_id           = "123456789012"
      + id                  = (known after apply)
      + name                = "ext-data-land"
      + number              = (known after apply)
      + project_id          = "data-team-lf6z"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.external-data-landing-zone.google_project_service.apis["compute.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "data-team-lf6z"
      + service            = "compute.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["container.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "data-team-lf6z"
      + service            = "container.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["iam.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "data-team-lf6z"
      + service            = "iam.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["storage.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "data-team-lf6z"
      + service            = "storage.googleapis.com"
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```
</details>